20260105T224818--kdoc-521-thinkpadでvtを有効化する__permanent.org
:properties:
:ID: 20260105T224818
:end:
#+title:      KDOC 521: ThinkpadでVTを有効化する
#+date:       [2026-01-05 Mon 22:48]
#+filetags:   :permanent:
#+identifier: 20260105T224818

* この文書のステータス
- 作成
  - [X] 2026-01-12 貴島
- レビュー
  - [X] 2026-02-01 貴島

* 概要

Intel VTは、CPUレベルでの仮想化支援技術だという。仮想環境を動かすパフォーマンスが向上する。Thinkpad X1 Carbon Gen10 では、初期状態だと有効化されていなかった。

有効化されてないと、 ~qemu~ などのOSエミュレーターが非常に遅く、OSの読み込み画面から進むのにすら数分かかった。

有効化するには、BIOSで設定する。

1. ロゴが出ている間にEnterを押して起動メニューを開く
2. F1を押してBIOS画面に入る
3. BIOS画面で Security > Virtualization > VTを有効化

* 関連
なし。
