20260105T224818--kdoc-521-thinkpadでvtを有効化する__permanent.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2026-02-22T17:43:30Z -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>KDOC 521: ThinkpadでVTを有効化する</title>
<meta name="author" content="kijimaD" />
<meta name="generator" content="Org Mode" />
<link rel='shortcut icon' type='image/x-icon' href='https://kijimad.github.io/roam/favicon.ico' /><link rel='stylesheet' href='https://cdn.jsdelivr.net/npm/bootstrap@5.3.3/dist/css/bootstrap.min.css' media='print' onload='this.media="all"' /><link rel='stylesheet' href='https://kijimad.github.io/roam/css/site.css' /><link rel='stylesheet' href='https://kijimad.github.io/roam/css/code.css' /><link rel='preconnect' href='https://fonts.googleapis.com'><link rel='preconnect' href='https://fonts.gstatic.com' crossorigin><link href='https://fonts.googleapis.com/css2?family=IBM+Plex+Sans+JP&display=swap' rel='stylesheet'>
</head>
<body>
<div id="preamble" class="status">
<div><div class="header"><div class="container"><div class="row"><div class="col-sm-12 col-md-12"><nav class="navbar navbar-light"/></div></div></div></div></div>
</div>
<div id="content" class="content">
<h1 class="title">KDOC 521: ThinkpadでVTを有効化する</h1>
<div id="outline-container-org22a5e92" class="outline-2">
<h2 id="org22a5e92"><a href="#org22a5e92">この文書のステータス</a></h2>
<div class="outline-text-2" id="text-org22a5e92">
<ul class="org-ul">
<li>作成
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> 2026-01-12 貴島</li>
</ul></li>
<li>レビュー
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> 2026-02-01 貴島</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgadcda04" class="outline-2">
<h2 id="orgadcda04"><a href="#orgadcda04">概要</a></h2>
<div class="outline-text-2" id="text-orgadcda04">
<p>
Intel VTは、CPUレベルでの仮想化支援技術だという。仮想環境を動かすパフォーマンスが向上する。Thinkpad X1 Carbon Gen10 では、初期状態だと有効化されていなかった。
</p>

<p>
有効化されてないと、 <code>qemu</code> などのOSエミュレーターが非常に遅く、OSの読み込み画面から進むのにすら数分かかった。
</p>

<p>
有効化するには、BIOSで設定する。
</p>

<ol class="org-ol">
<li>ロゴが出ている間にEnterを押して起動メニューを開く</li>
<li>F1を押してBIOS画面に入る</li>
<li>BIOS画面で Security &gt; Virtualization &gt; VTを有効化</li>
</ol>
</div>
</div>
<div id="outline-container-orgd64318e" class="outline-2">
<h2 id="orgd64318e"><a href="#orgd64318e">関連</a></h2>
<div class="outline-text-2" id="text-orgd64318e">
<p>
なし。
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer class="footer py-3"><div class="container"><div class="row "><div class="col-md-4"></div><div class="col-sm col-md"><nav class="navbar"><a class="nav-link text-secondary small px-0" href="./index.html">Insomnia</a><a class="nav-link text-secondary small px-0" href="./sitemap.html">Sitemap</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD/roam">Repository</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD">@kijimaD</a></nav></div><div class="col-md-4"></div></div></div></footer>
</div>
</body>
</html>
